jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
#include "watchdog_record.h"
#include "ch582f_ajazz.h"
#include "bluetooth.h"
#include "quantum.h"
#include "hal.h"
#include "health.h"   /* health_note_rx_malformed() -- main-loop context only */

#ifndef CH582_SERIAL_DRIVER
#    define CH582_SERIAL_DRIVER SD2
#endif

#define TX_MAX_PAYLOAD 16

/* Mirror the stock firmware's ACK behaviour: after receiving a 5B (connection
 * state) or 5C (battery) frame, the stock MCU replies with the 61 0D 0A ("a\r\n")
 * ACK token ~1.3 ms later. It does NOT ack 5A (LED) frames. Logic-analyzer-
 * confirmed against a stock BT boot. Experimental: enable to test whether a
 * "well-behaved" peer yields cleaner cold-boot connects or new frame types.
 * Define CH582_ACK_FRAMES=0 in config.h to disable. */
#ifndef CH582_ACK_FRAMES
#    define CH582_ACK_FRAMES 1
#endif

/* How often to re-issue the channel-select command while a connection is
 * requested but not yet established. At cold boot the dip-switch callback fires
 * a one-shot 0xA6 microseconds after sdStart(), before the CH582F has finished
 * its own power-up, so that first command is dropped. Retrying until the module
 * answers with a connect event makes boot-in-BT work. */
#ifndef CH582_CONNECT_RETRY_MS
#    define CH582_CONNECT_RETRY_MS 500
#endif

/* How often to poll the module for battery level. The module is silent in steady
 * state; the stock firmware periodically sends `A6 53` and the module answers with
 * a `5C <pct>` frame. (The LCD clock is NOT on this wire: the set-time utility
 * talks to the MCU directly, so time never crosses the CH582 serial link.) */
/* Retry cadence for the FIRST reading only, until the module has answered once.
 * Short because a boot with no battery shown is the visible symptom, and each
 * attempt is one ~10-byte frame. */
#ifndef CH582_BATTERY_FIRST_POLL_MS
#    define CH582_BATTERY_FIRST_POLL_MS 250
#endif
#ifndef CH582_BATTERY_POLL_MS
#    define CH582_BATTERY_POLL_MS 5000
#endif

/* Fallback for a MISSED `5B 32`. That frame is the only "connected" signal the
 * module ever sends, it is sent once at link-up, and the RX line is silent at
 * idle -- so dropping it strands conn_state in LINKING forever while the link is
 * actually live (observed: channel digit blinks indefinitely after a successful
 * pair, cleared only by toggling the mode slider).
 *
 * A `5A` host-LED frame is decent evidence of a live link, since a host only
 * sends LED state to a device it is connected to. But `5A` is exactly what the
 * power-up / 2.4G link-up burst forges (see the 5A case below), so promoting on
 * it naively would trade a stuck-blinking digit for a false "connected".
 * Requiring the LINKING state to have persisted this long first steps past that
 * burst: a genuine `5B 32` arrives at link-up and would already have won, so
 * anything still LINKING after this window is a frame we missed, not one in
 * flight. Delay is cosmetic-only -- the digit is the sole consumer. */
/* Pairing is CONFIRMED by a `5B 31`, not by having sent `A6 51`. The module
 * appears to IGNORE the pair command while a connect attempt it started is still
 * in flight (`5B 33`/`34`), and only accepts it once that attempt is abandoned
 * (`5B 36`) or otherwise settles. Pressing a slot key issues a connect, so a
 * hold-to-pair fires straight into exactly that window and the single `A6 51`
 * is silently dropped.
 *
 * Symptom this caused: hold 1 s -> nothing, hold 2 s -> nothing, hold 3 s ->
 * works. It reads as a timing threshold and is not one; by the third attempt the
 * module has simply given up on connecting and is finally listening. A one-shot
 * capture happened to catch it already-abandoned and "confirmed" 1 s, which is
 * how this hid.
 *
 * So retry `A6 51` until the module actually says `5B 31`. */
/* A select (`A6 <slot>`) issued while the module is ADVERTISING is DECLINED.
 * Captured on the wire 2026-08-29:
 *
 *   [tx] A6 51 pair      -> [rx] 5B 31   module advertising
 *   [tx] A6 32 select    -> [rx] 5B 23   idle. No 33 (attempting), no 32.
 *   [tx] A6 33 select    -> [rx] 5B 36
 *   [tx] A6 32 select    -> [rx] 5B 32   works after the back-and-forth
 *
 * Note it is NOT a lost frame: the module answers, with `5B 23`. It stops
 * advertising and simply never starts connecting. Symptom: after entering
 * pairing and going back to a paired device, it will not reconnect until you
 * switch slots back and forth.
 *
 * The select is otherwise NEVER re-issued once module_alive is set (see the
 * cold-boot retry below), so a declined select is unrecoverable by design.
 *
 * Retry ONLY while the module has not started an attempt. A working select is
 * answered with 33/34/32 inside a second (measured), so absence of any of those
 * is a reliable "it declined". This deliberately does NOT re-issue once 33/34
 * has arrived -- that is exactly the slow macOS directed-advertising case the
 * cold-boot guard protects, where re-selecting restarts advertising and starves
 * a reconnect that was progressing fine.
 *
 * SECOND MEASUREMENT (the first fix was too impatient and did NOT work):
 *
 *   5B 31            advertising starts
 *   A6 32   +2s      declined
 *   reselect +3s     declined
 *   reselect +4s     declined      <- gave up here
 *   5B 23    +6s     module goes IDLE, one second too late
 *
 * The module ignores a select for as long as it is advertising, and only becomes
 * receptive once it emits `5B 23` (idle/finalize). Three tries over ~3.6 s all
 * landed inside the advertising window. So the retry is now driven by that
 * EVENT, not only by the clock: a `5B 23` while a select is pending re-issues it
 * immediately, which is the exact moment the module is free. The timed retry
 * remains as a backstop and the try budget is wider (8). */
#ifndef CH582_SELECT_CONFIRM_MS
#    define CH582_SELECT_CONFIRM_MS 1500
#endif
#ifndef CH582_SELECT_MAX_TRIES
#    define CH582_SELECT_MAX_TRIES 8
#endif

#ifndef CH582_PAIR_RETRY_MS
#    define CH582_PAIR_RETRY_MS 400
#endif
#ifndef CH582_PAIR_MAX_TRIES
#    define CH582_PAIR_MAX_TRIES 12   /* ~4.8 s of trying, then give up */
#endif

