jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
#ifndef CH582_5A_PROMOTE_MS
#    define CH582_5A_PROMOTE_MS 3000
#endif

static volatile bool    is_module_connected = false;
/* Active BT slot 1-3. Derived from the selected 0xA6 profile, NOT from the 5B
 * stream: a logic-analyzer capture proved the 5B second byte is a handshake-STAGE
 * code (0x23/0x31..0x34 seen regardless of slot), not the slot number. 0 = none. */
static volatile uint8_t connected_slot = 0;

/* True while the module is advertising / waiting to bond (5B 31). */
static volatile bool    is_pairing = false;
/* Detailed connection state for the LCD indicator (superset of the two bools). */
static volatile ch582_conn_state_t conn_state = CH582_CONN_IDLE;
/* When conn_state last became CH582_CONN_LINKING, for the 5A promotion window
 * above. Deliberately NOT last_attempt_time, which the connect retry resets
 * every CH582_CONNECT_RETRY_MS and so never accumulates. 32-bit so a long stall
 * in LINKING cannot wrap back under the window. */
static volatile uint32_t linking_since = 0;
/* Battery percentage (0-100) from 5C frames; 0xFF until the module first reports. */
static volatile uint8_t battery_level = 0xFF;
/* Host keyboard LED bitmap from 5A frames (USB LED bits; bit1 = caps lock). */
static volatile uint8_t host_leds = 0;

/* Pending connection request: the profile the user asked for, retried until the
 * module reports connected (or the request is cleared by leaving BT mode). */
static volatile bool    connect_requested = false;
static volatile uint8_t requested_profile = 0;
/* True while the mode slider is in the USB position (wireless link not in use).
 * Set from the dip-switch handler via ch582_cancel_connect / ch582_set_profile. */
static volatile bool    usb_mode = false;
/* True once the module has ACKed anything, i.e. its UART is up and receiving.
 * Cold boot is the only time it is false (the boot-time slot select can fire
 * before the CH582F finishes powering up). Used to bound the select retry: we
 * re-issue the select only until the module is alive, NOT until it connects --
 * re-selecting a live module restarts its advertising and starves slow (macOS)
 * reconnects, which need the peripheral to keep advertising uninterrupted. */
static volatile bool    module_alive = false;

#ifndef CH582_BOUNCE_MS
#    define CH582_BOUNCE_MS 700
#endif

/* THE pending control action -- at most one exists at a time, and
 * supersession is total. This used to be three parallel flag/timer/counter
 * triplets (bounce_pending/select_pending/pairing_pending), each added by a
 * separate incident; the next BT bug was going to be an interaction between
 * two of them. The transition spec, wire captures and do-not-break
 * invariants live in hardening-plan/findings-ch582-states.md (workspace
 * repo) -- behaviour here is byte-identical to the triplet version.
 *
 *   PA_SELECT: an A6 <slot> sent but the module has not acted on it
 *              (5B 33/34/32). Re-sent on a 1.5 s clock AND immediately on a
 *              5B 23 (the moment an advertising module becomes receptive --
 *              clock-only retries measurably missed that window). MUST stop
 *              the moment 33/34 arrives: re-selecting an attempting module
 *              restarts advertising and starves slow macOS reconnects.
 *   PA_PAIR:   an A6 51 sent but no 5B 31 confirmation -- the module drops
 *              the pair command while a connect attempt is in flight, so it
 *              is re-sent every 400 ms until confirmed (or connected, or
 *              out of budget).
 *   PA_BOUNCE: cancel-pairing bounce (see ch582_set_profile): a DIFFERENT
 *              slot was sent to force the advertising module out of its
 *              same-slot-select-is-a-no-op state; after CH582_BOUNCE_MS the
 *              action becomes PA_SELECT on the real target.
 *
 * The cold-boot select retry below is deliberately NOT a kind here: its
 * lifecycle (uncapped, until the first ACK proves the module's UART is up,
 * fires regardless of what else is pending) is genuinely different. */
typedef enum { PA_NONE = 0, PA_BOUNCE, PA_SELECT, PA_PAIR } pa_kind_t;
static struct {
    pa_kind_t kind;
    uint8_t   target;     /* PA_SELECT/PA_BOUNCE: the REAL slot wanted */
    uint16_t  last_send;
    uint8_t   tries;
} pa = { PA_NONE, 0, 0, 0 };

static uint16_t         last_attempt_time = 0;
/* Last time a battery poll (A6 53) was sent. */
static uint16_t         last_battery_poll = 0;
/* Battery observability (debug page). battery_level alone cannot distinguish
 * "the module says 100%" from "the module has never answered", because the
 * 0xFF initial value is masked by the d <= 100 guard on the way in. */
static uint16_t         battery_last_recv = 0;
static bool             battery_seen      = false;
static uint8_t          battery_min       = 100;

/* Request a battery-level report from the module. Logic-analyzer-decoded from the
 * stock firmware: the MCU sends `A6 53` and the module replies with a `5C <pct>`
 * frame (parsed in ch582_task). The module is otherwise silent, so battery only
 * updates if we poll. */
#define CH582_BATTERY_REQ_PARAM 0x53
void ch582_poll_status(void) {
    uint8_t param = CH582_BATTERY_REQ_PARAM;
    ch582_send_command(0xA6, &param, 1);
}

typedef enum {
    STATE_WAIT_TYPE = 0,
    STATE_WAIT_DATA,
    STATE_WAIT_CHECKSUM
} parse_state_t;

#ifdef WDT_TEST_HOOKS
/* Fault-injection ring (instrumented builds; see the parser loop). Main-loop
 * only: filled from raw HID (main loop), drained from ch582_task (main loop). */
#define CH582_INJECT_MAX 64
#define CH582_A6_TRACE   16
static uint8_t inj_buf[CH582_INJECT_MAX];
static uint8_t inj_head = 0, inj_tail = 0;

/* While muted, REAL UART bytes are drained and discarded so the parser sees
 * only injected traffic -- the live module answers A6 commands even in wired
 * mode, and its interleaved 5B frames made the pending-action tests
 * nondeterministic (Codex phase-4 review #1). */
static bool ch582_rx_muted = false;
void ch582_rx_mute(bool on) { ch582_rx_muted = on; }

