jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
void ch582_inject(const uint8_t *bytes, uint8_t len) {
    for (uint8_t i = 0; i < len; i++) {
        uint8_t nxt = (uint8_t)((inj_tail + 1) % CH582_INJECT_MAX);
        if (nxt == inj_head) return;   /* full: drop the rest, tests keep packets small */
        inj_buf[inj_tail] = bytes[i];
        inj_tail          = nxt;
    }
}

bool ch582_inject_pop(uint8_t *out) {
    if (inj_head == inj_tail) return false;
    *out     = inj_buf[inj_head];
    inj_head = (uint8_t)((inj_head + 1) % CH582_INJECT_MAX);
    return true;
}

/* Outbound A6 trace: the last CH582_A6_TRACE params sent, newest last, plus a
 * running count. This is what lets a host test OBSERVE the pending-action
 * machinery (supersession, the bounce's two ordered selects, retry cadence)
 * instead of only the rx-driven state -- the Codex phase-3 review's gap.
 * Recorded at enqueue, which equals send order: 0xA6 is never coalesced. */
static uint8_t  a6_trace[CH582_A6_TRACE];
static uint8_t  a6_trace_n = 0;    /* valid entries, saturates at the ring size */
static uint16_t a6_count   = 0;

static void a6_trace_note(uint8_t param) {
    if (a6_trace_n == CH582_A6_TRACE) {
        memmove(a6_trace, a6_trace + 1, CH582_A6_TRACE - 1);
        a6_trace_n--;
    }
    a6_trace[a6_trace_n++] = param;
    a6_count++;
}

uint8_t ch582_a6_trace(uint8_t *out, uint16_t *count) {
    memcpy(out, a6_trace, a6_trace_n);
    *count = a6_count;
    return a6_trace_n;
}
#endif

static const SerialConfig serial_cfg = {
    .speed               = 115200,
    .UART_WordLength     = 3,  // 8 data bits
    .UART_StopBits       = 0,  // 1 stop bit
    .UART_Parity         = 0,  // No parity
    .UART_FIFOControl    = 0,
    .UART_AutoBaudControl = 0,
    .UART_Oversampling   = 16,
    .UART_HalfDuplexMode = 0,
};

void ch582_send_keyboard_report(report_keyboard_t *report) {
    /* Boot keyboard report = [mods][reserved][key1..key6]; this matches the
     * stock A1 frame byte-for-byte.
     *
     * ⚠️ report->keys is valid here ONLY because bluetooth_can_send_nkro()
     * returns false, so QMK always hands this function a genuine
     * report_keyboard_t. An earlier comment claimed keys[] was safe
     * "regardless of NKRO (first member of the report union)" -- WRONG in
     * this tree (caught by Rachel, 2026-09-01): report_keyboard_t and
     * report_nkro_t are two SEPARATE packed structs in report.h, the NKRO
     * one has no keys[] slot array at all (it is a mods+bitmap layout), and
     * their leading bytes differ (report_id is unconditional in NKRO,
     * KEYBOARD_SHARED_EP-gated -- i.e. absent here -- in the boot report).
     * If anyone ever flips can_send_nkro to true, this function must grow a
     * bitmap->slots conversion; reading keys[] off an NKRO report would be
     * silent garbage. */
    uint8_t buf[8];
    buf[0] = report->mods;
    buf[1] = 0; /* reserved */
    for (uint8_t i = 0; i < 6; i++) {
        buf[2 + i] = report->keys[i];
    }
    ch582_send_command(0xA1, buf, sizeof(buf));
}

/* --- QMK Bluetooth driver API ------------------------------------------------
 * With BLUETOOTH_DRIVER = custom, QMK's host.c routes key reports to bt_driver
 * (these bluetooth_* functions) whenever the active connection host is
 * Bluetooth, and to the USB driver otherwise. The mode slider drives the active
 * host (see dip_switch_update_user). No host_set_driver hacks, no clobber, and
 * no manual USB/wireless routing -- core handles it. */
void bluetooth_init(void) {
    is_module_connected = false;
    sdStart(&CH582_SERIAL_DRIVER, &serial_cfg);
}

void bluetooth_task(void) {
    ch582_task();
}

bool bluetooth_is_connected(void) {
    return is_module_connected;
}

/* The module's wireless input is a 6KRO boot report (A1). Reporting NKRO as
 * unsupported makes host_can_send_nkro() return false while Bluetooth is the
 * active host, so QMK sends a plain boot report_keyboard_t via
 * bluetooth_send_keyboard() -- no NKRO->boot conversion needed here. USB keeps
 * NKRO (keyboard.json "nkro": true) when USB is the active host. */
bool bluetooth_can_send_nkro(void) {
    return false;
}

uint8_t bluetooth_keyboard_leds(void) {
    return host_leds;
}

void bluetooth_send_keyboard(report_keyboard_t *report) {
    ch582_send_keyboard_report(report);
}

void bluetooth_send_nkro(report_nkro_t *report) {
    /* Not reached: bluetooth_can_send_nkro() is false. Stubbed for safety. */
}

void bluetooth_send_mouse(report_mouse_t *report) {}

/* Consumer control (volume/media, e.g. the encoder) over the wireless link.
 * The encoder emits HID consumer usages; without forwarding them here they only
 * work over USB. Frame is 0xA3 + 2-byte little-endian usage, mirroring the A1
 * keyboard framing -- confirmed working on hardware over both BT and 2.4G.
 *
 * Gated on connect_requested ONLY -- deliberately NOT on is_module_connected.
 * `5B 32` is the single, never-repeated "connected" announcement, so one lost
 * frame strands conn_state in LINKING forever (see CH582_5A_PROMOTE_MS). While
 * stranded, is_module_connected is false and this used to silently drop every
 * media keypress -- volume dead over BT while typing kept working, because
 * bluetooth_send_keyboard() has no such gate. That asymmetry was the bug: the
 * keyboard path already sends regardless, and a consumer frame sent to a link
 * that is genuinely down simply goes nowhere. Match the keyboard path. */
void bluetooth_send_consumer(uint16_t usage) {
    if (!connect_requested) return;
    uint8_t buf[2];
    buf[0] = usage & 0xFF;
    buf[1] = (usage >> 8) & 0xFF;
    ch582_send_command(0xA3, buf, sizeof(buf));
}

void bluetooth_send_system(uint16_t usage) {}

#ifdef RAW_ENABLE
/* Raw-HID replies go back over USB even in wireless mode.
 *
 * The default is a WEAK NO-OP in drivers/bluetooth/bluetooth.c, and
 * tmk_core/protocol/host.c wires it in as the Bluetooth driver's .send_raw_hid.
 * So in BT/2.4G mode host_raw_hid_send() hands every reply to an empty function
 * and they are SILENTLY DISCARDED -- the CH582F protocol has no concept of raw
 * HID and there is nowhere for them to go.
 *
 * Consequences, all of which read as "the tool is broken":
 *   - VIA cannot complete its handshake, so it will not connect at all
 *   - every round-trip ak820ctl command fails (info, flash write, flash crc)
 *   - and it fails EVEN WITH THE USB CABLE PLUGGED IN, because the dip switch,
 *     not the cable, is what selects the active host driver
 *
 * Inbound reports are unaffected: they arrive on the USB OUT endpoint whatever
 * the dip switch says, which is why the request lands and only the answer
 * disappears. That asymmetry is what makes it look like a tooling bug.
 *
 * Raw HID is a HOST-TOOL channel, not a typing channel. There is no reason for
 * it to follow the keyboard's output route -- send it back the way it came.
 *
 * Safe when USB is down: send_report() is bounded at 100 ms, and a reply can
 * only exist in response to a request that arrived over USB in the first place,
 * so on battery this is never reached. */
extern void send_raw_hid(uint8_t *data, uint8_t length);  /* chibios/usb_main.c */

void bluetooth_send_raw_hid(uint8_t *data, uint8_t length) {
    send_raw_hid(data, length);
}
#endif

