jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
/* --- reliable (ACK'd, retrying) TX queue --------------------------------------
 * The module ACKs every frame we send with `61 0D 0A`. Sending once and ignoring
 * that ACK means a dropped/checksum-rejected frame is simply lost -- for a key
 * RELEASE that strands the key and the host auto-repeats it (the sporadic BT
 * stuck-key). Stock (and the open @isuua reference in aliou/keebs,
 * vendor/edthu-wireless -- the same module protocol) instead queue each frame and
 * retransmit until the module ACKs. This is a minimal port of that: one frame
 * in flight at a time, retried on ACK-timeout, popped on ACK. Frames are
 * idempotent (they carry STATE, not events), so a retransmit is always safe. */
#define CH582_TXQ_LEN       24
#define CH582_TX_FRAME_MAX  (TX_MAX_PAYLOAD + 2)
#ifndef CH582_TX_ACK_TIMEOUT_MS
#    define CH582_TX_ACK_TIMEOUT_MS 10
#endif
#ifndef CH582_TX_MAX_RETRIES
#    define CH582_TX_MAX_RETRIES 8
#endif

typedef struct {
    uint8_t data[CH582_TX_FRAME_MAX];
    uint8_t len;
} ch582_tx_frame_t;

static ch582_tx_frame_t tx_q[CH582_TXQ_LEN];
static uint8_t          tx_head = 0, tx_tail = 0;   /* head = frame in flight / next to send */
static bool             tx_in_flight = false;
static uint16_t         tx_sent_time = 0;
static uint8_t          tx_retries   = 0;

/* TX health counters. NOTE (corrected 2026-09-01, audit BW-5): an earlier
 * comment here claimed the RX FIFO was disabled and a byte had to be serviced
 * within ~87 us. WRONG -- the SN32 serial LLD ALWAYS enables the 16550-style
 * 16-byte FIFO; `UART_FIFOControl = 0` in serial_cfg merely selects an RX
 * threshold of 1 (IRQ per byte), so the real overrun tolerance is ~16 bytes
 * ~= 1.4 ms at 115200. The historical byte loss came from the interrupt
 * priority inversion starving the ISR past even that, not from a missing
 * FIFO. A lost ACK stalls the in-flight frame for CH582_TX_ACK_TIMEOUT_MS,
 * and a keystroke is two frames -- so ACK loss shows up as throughput
 * collapse (you can out-type the link), not as mild latency. */
static uint32_t tx_stat_sent = 0, tx_stat_timeout = 0, tx_stat_drop = 0;

#ifdef CONSOLE_ENABLE
/* ACK turnaround, instrumented builds (2026-09-23): docs/wireless.md asks for
 * this before CH582_TX_ACK_TIMEOUT_MS is touched -- ~half of all frames time
 * out at 10 ms and are ACKed after one retransmit. Measured from the FIRST
 * send of a frame, in 1 ms buckets (the last pools >= 15 ms), plus the worst
 * case and the number of retransmits the frame needed. `orphan` counts ACKs
 * that arrive with nothing in flight: if `61 0D 0A` were also a periodic
 * heartbeat (the other reading of the parser's comments), it would show there. */
#define ACK_BUCKETS 16u
static systime_t tx_first_sent_st;
static uint32_t  ack_hist[ACK_BUCKETS], ack_orphan, ack_after_retry, ack_max_us;
/* UART receive errors, from the serial driver's event flags. The driver now
 * reports a hardware overrun (a byte lost with the FIFO full) as
 * SD_OVERRUN_ERROR, the flag it already raised for a full input queue.
 * Counted per task pass that saw each, not per byte: a trend, for the
 * wireless tests. */
static event_listener_t uart_err_listener;
static uint32_t         uart_err_overrun, uart_err_framing, uart_err_parity;
#endif

/* Health-counter readout (health.c). Main-loop only, like everything here. */
void ch582_tx_stats(uint32_t *sent, uint32_t *timeouts, uint32_t *drops) {
    *sent     = tx_stat_sent;
    *timeouts = tx_stat_timeout;
    *drops    = tx_stat_drop;
}

static inline uint8_t tx_next(uint8_t i) { return (uint8_t)((i + 1) % CH582_TXQ_LEN); }

/* Drop the head frame (ACKed or given up) and stop waiting on it. */
static void ch582_tx_pop(void) {
    if (tx_head != tx_tail) tx_head = tx_next(tx_head);
    tx_in_flight = false;
    tx_retries   = 0;
}

/* Advance the queue: send the head frame, time out and retransmit, or give up.
 * Called every ch582_task() (main-loop cadence, sub-ms), so the 10 ms timeout is
 * honoured with fine granularity. */
static void ch582_tx_pump(void) {
    if (tx_in_flight) {
        if (timer_elapsed(tx_sent_time) < CH582_TX_ACK_TIMEOUT_MS) return;   /* still waiting for ACK */
        tx_stat_timeout++;
        if (++tx_retries > CH582_TX_MAX_RETRIES) { ch582_tx_pop(); return; } /* give up, move on */
        sdWrite(&CH582_SERIAL_DRIVER, tx_q[tx_head].data, tx_q[tx_head].len); /* retransmit */
        tx_sent_time = timer_read();
        return;
    }
    if (tx_head == tx_tail) return;                                          /* queue empty */
    sdWrite(&CH582_SERIAL_DRIVER, tx_q[tx_head].data, tx_q[tx_head].len);
    tx_sent_time = timer_read();
#ifdef CONSOLE_ENABLE
    tx_first_sent_st = chVTGetSystemTimeX();
#endif
    tx_in_flight = true;
    tx_stat_sent++;
}

/* The module ACKed the in-flight frame -> drop it and let the next one go. Also
 * the first proof the module's UART is up (see module_alive). */
static void ch582_tx_ack(void) {
    module_alive = true;
#ifdef CONSOLE_ENABLE
    if (tx_in_flight) {
        uint32_t us = TIME_I2US(chVTTimeElapsedSinceX(tx_first_sent_st));
        uint32_t ms = us / 1000u;
        ack_hist[ms < ACK_BUCKETS ? ms : ACK_BUCKETS - 1u]++;
        if (us > ack_max_us) ack_max_us = us;
        if (tx_retries) ack_after_retry++;
    } else {
        ack_orphan++;
    }
#endif
    if (tx_in_flight) ch582_tx_pop();
}

void ch582_send_command(uint8_t cmd, const uint8_t *params, uint8_t param_len) {
    if (param_len > TX_MAX_PAYLOAD) return;

    /* NEWEST-SUPERSEDES for STATE frames (audit BW-6). 0xA1 (keyboard) and
     * 0xA3 (consumer) carry absolute state, not events -- the frame contract
     * above says so -- so if one of the same type is already QUEUED (not the
     * in-flight head), the newer state can simply overwrite it in place.
     * Under a typing burst against a stalled link the queue then converges to
     * the true final state instead of filling and DROPPING a release, which
     * was a stuck key over BT (queue-full needed ~23 frames: ACK stall x
     * burst).
     *
     * Gated on the queue being NEARLY FULL, not always-on: coalescing eats
     * intermediate edges (a double-tap queued during a stall collapses into
     * a continuous hold), so while there is room, every edge still ships in
     * order -- delayed-but-complete beats collapsed. Only when the ring is
     * about to overflow does convergence-to-final-state take over, because
     * the alternative at that point is the stuck-key drop.
     *
     * ⚠️ NEVER coalesce 0xA6 (or anything else): the cancel-pairing bounce
     * depends on ORDERED, DISTINCT selects (bounce slot, then target) --
     * collapsing them re-derives the documented same-slot-select no-op trap. */
    uint8_t used = (uint8_t)((tx_tail - tx_head + CH582_TXQ_LEN) % CH582_TXQ_LEN);
    if ((cmd == 0xA1 || cmd == 0xA3) && used >= CH582_TXQ_LEN - 4) {
        /* Overwrite the LAST queued frame of this type, never an earlier one:
         * frames behind an overwritten earlier slot would deliver OLDER state
         * after the newest and the host would end wrong. */
        ch582_tx_frame_t *last = NULL;
        uint8_t i = tx_in_flight ? tx_next(tx_head) : tx_head;
        for (; i != tx_tail; i = tx_next(i)) {
            if (tx_q[i].data[0] == cmd) last = &tx_q[i];
        }
        if (last) {
            uint16_t s = cmd;
            for (uint8_t j = 0; j < param_len; j++) {
                last->data[1 + j] = params[j];
                s += params[j];
            }
            last->data[param_len + 1] = (uint8_t)(s & 0xFF);
            last->len                 = param_len + 2;
            return;
        }
    }

    uint8_t nxt = tx_next(tx_tail);
    if (nxt == tx_head) { tx_stat_drop++; return; }  /* queue full -> DROPPED KEYSTROKE */

    ch582_tx_frame_t *f = &tx_q[tx_tail];
    uint16_t sum = cmd;
    f->data[0]   = cmd;
    for (uint8_t i = 0; i < param_len; i++) {
        f->data[1 + i] = params[i];
        sum += params[i];
    }
    f->data[param_len + 1] = (uint8_t)(sum & 0xFF);
    f->len                 = param_len + 2;
    tx_tail                = nxt;
#ifdef WDT_TEST_HOOKS
    /* Battery polls (A6 53) are periodic noise; excluding them makes the
     * count an EXACT observable for the pending-action tests. */
    if (cmd == 0xA6 && param_len == 1 && params[0] != 0x53) a6_trace_note(params[0]);
#endif
}

