jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
#if CH582_ACK_FRAMES
/* Raw 61 0D 0A ACK token (not a checksummed command, so it bypasses
 * ch582_send_command). Stock replies with this to 5B/5C frames. */
static void ch582_send_ack(void) {
    static const uint8_t ack[3] = {0x61, 0x0D, 0x0A};
    sdWrite(&CH582_SERIAL_DRIVER, ack, sizeof(ack));
}
#endif

void ch582_set_profile(ch582_profile_t profile) {
    uint8_t param        = (uint8_t)profile;
    bool    was_pairing  = (conn_state == CH582_CONN_PAIRING);

    pa.kind             = PA_NONE;  /* a new selection supersedes any pending action */
    requested_profile   = param;
    connect_requested   = true;
    usb_mode            = false;
    is_module_connected = false;
    conn_state          = CH582_CONN_LINKING;   /* attempting until 5B says otherwise */
    linking_since       = timer_read32();
    last_attempt_time   = timer_read();

    /* CANCEL-PAIRING BOUNCE.
     *
     * Selecting the slot that is CURRENTLY ADVERTISING is a flat no-op -- the
     * module appears to read it as "you are already on that slot". MEASURED
     * 2026-08-29: eight `A6 32` sent over 10 s while advertising on slot 2 drew
     * ZERO responses; the module is entirely silent until it finally emits one
     * `5B 23`. Retrying, on a timer or on that idle event, cannot fix it -- both
     * were tried and both failed.
     *
     * Naming a DIFFERENT slot does force a state change, which is exactly why
     * the manual workaround (Fn+Q then Fn+W) works. So do that: send another
     * slot, wait CH582_BOUNCE_MS, then send the real target.
     *
     * The bounce slot may itself be bonded, so this can briefly attempt a link
     * to the wrong device. It is bounded -- the real select follows 700 ms later
     * and, being a DIFFERENT slot from the bounce, is honoured normally. Only
     * reachable when cancelling pairing, never on an ordinary slot change. */
    if (was_pairing && param >= CH582_PROFILE_BT_1 && param <= CH582_PROFILE_BT_3) {
        uint8_t other = (param == CH582_PROFILE_BT_1)
                            ? (uint8_t)CH582_PROFILE_BT_2
                            : (uint8_t)CH582_PROFILE_BT_1;
        pa.kind      = PA_BOUNCE;    /* no select retries until the real one goes out */
        pa.target    = param;
        pa.last_send = timer_read();
        ch582_send_command(0xA6, &other, 1);
        return;
    }

    pa.kind      = PA_SELECT;
    pa.target    = param;
    pa.tries     = 1;
    pa.last_send = timer_read();
    ch582_send_command(0xA6, &param, 1);
}

/* Pairing command, decoded from stock TX captures: a CONSTANT `0xA6 0x51`, sent
 * twice, which puts the CURRENTLY-SELECTED slot into pairing/advertising. It
 * carries no slot of its own (slot 2 and slot 3 pairing BOTH emitted `A6 51`), so
 * the target slot must already be selected via ch582_set_profile() first. This is
 * why the stock long-press only pairs the active slot. The old 0xA9/0xA1 guess was
 * wrong (0xA1 is the keystroke opcode). */
#define CH582_PAIR_PARAM 0x51

void ch582_enter_pairing(void) {
    uint8_t param       = CH582_PAIR_PARAM;
    is_module_connected = false;
    is_pairing          = true;
    /* Optimistic: show pairing immediately for feedback, and let the retry below
     * make it true. Waiting for 5B 31 to update the display would leave the band
     * showing "Link failed" for seconds after the user did the right thing. */
    conn_state          = CH582_CONN_PAIRING;
    pa.kind             = PA_PAIR;   /* supersedes a pending select/bounce */
    pa.tries            = 1;
    pa.last_send        = timer_read();
    /* Sent ONCE, matching the @isuua/edthu reference. Stock repeated it, but the
     * ACK/retry queue now guarantees delivery, so one is enough. */
    ch582_send_command(0xA6, &param, 1);
}

void ch582_pair(ch582_profile_t profile) {
    /* Select the slot, then put it into pairing. (On stock, select is the short
     * press and pairing the long press on the same slot; this convenience helper
     * does both for callers that just want "pair this slot now".) */
    ch582_set_profile(profile);
    ch582_enter_pairing();
}

void ch582_cancel_connect(void) {
    connect_requested = false;
    usb_mode          = true;
    conn_state        = CH582_CONN_IDLE;
}

bool ch582_is_connected(void) {
    return is_module_connected;
}

uint8_t ch582_get_slot(void) {
    return connected_slot;
}

bool ch582_is_24g(void) {
    return !usb_mode && requested_profile == CH582_PROFILE_PEER_24G;
}

bool ch582_is_usb(void) {
    return usb_mode;
}

bool ch582_is_pairing(void) {
    return is_pairing;
}

uint8_t ch582_get_battery(void) {
    return battery_level;
}

/* Lowest percent ever reported since boot, or 0xFF if the module has never
 * answered at all. Still 100 after weeks of use means either the cell has never
 * meaningfully discharged or the number is not tracking anything. */
uint8_t ch582_battery_min(void) {
    return battery_seen ? battery_min : 0xFF;
}

/* Milliseconds since the last 5C frame, saturating at 0xFFFF. UINT32_MAX if the
 * module has never sent one -- the caller must not render that as an age. */
uint32_t ch582_battery_age_ms(void) {
    if (!battery_seen) return UINT32_MAX;
    return timer_elapsed(battery_last_recv);
}

uint8_t ch582_get_host_leds(void) {
    return host_leds;
}

/* Map a selected 0xA6 profile byte (0x31..0x33) to a 1..3 slot; 0 for 2.4G/none. */
static uint8_t profile_to_slot(uint8_t profile) {
    if (profile >= CH582_PROFILE_BT_1 && profile <= CH582_PROFILE_BT_3) {
        return profile - 0x30;
    }
    return 0;
}

ch582_conn_state_t ch582_get_conn_state(void) {
    return conn_state;
}

/* Slot to display: the slot we are aiming for, valid while linking/pairing (not
 * just when connected). 2.4G shows as slot 1; USB/none is 0. */
uint8_t ch582_get_target_slot(void) {
    if (usb_mode) return 0;
    if (requested_profile == CH582_PROFILE_PEER_24G) return 1;
    return profile_to_slot(requested_profile);
}

void ch582_task(void) {
    WDT_SCOPE(WDT_SITE_WIRELESS);
    /* Rolling 3-byte window over the RX stream. The module interleaves two frame
     * formats with no length prefix, and the stream can drop bytes on a burst, so
     * a fixed [type,data,cksum] state machine desyncs permanently. Matching on a
     * sliding window instead self-resynchronises and tolerates dropped bytes.
     *
     * Logic-analyzer-decoded against stock firmware. The ONLY trustworthy
     * connection signals are the 5B state transitions; everything else (61 0D 0A,
     * 5C battery, 5B 23) is periodic and streams regardless of link state:
     *   - 61 0D 0A   -> "a\r\n": the per-frame ACK (see the parser below). An
     *                   older reading called it a periodic idle heartbeat; the
     *                   2026-09-23 measurement says ACK -- one ACK arrived with
     *                   nothing in flight in ~2,200 frames (docs/wireless.md).
     *                   Either way, ignore it for connection state.
     *   - 5A <led>   -> host keyboard LED bitmap (USB LED bits; bit1 = caps lock)
     *   - 5B <code>  -> connection state machine (code is a STATE, not a slot):
     *        32 = link established (connected);  31 = advertising/pairing;
     *        33/34 = connect ATTEMPT (link down, retrying);  23 = idle (ignore,
     *        it appears both connected and disconnected).
     *   - 5C <pct>   -> battery percent in decimal (0x64=100). PERIODIC and link-
     *                   independent (streams even while disconnected) -> never use
     *                   it as a "connected" signal. */
    static uint8_t b2 = 0, b1 = 0, b0 = 0;

    /* Cold-boot-only select retry. The mode slider is wired directly to the
     * CH582F, so once the module is up it handles advertising/reconnect itself
     * (like the @isuua/edthu reference, which sends the select ONCE per switch).
     * We must NOT keep re-issuing the select on a live module: re-selecting
     * restarts its advertising and starves slow reconnects -- a phone reconnects
     * in <500 ms and beats the retry, but macOS directed-advertising takes longer
     * and never completes, so it needed a manual pairing entry. The only case
     * that genuinely needs a retry is cold boot, where the boot-time select fires
     * before the CH582F's UART is up and is dropped. So retry ONLY until the
     * module is alive (has ACKed anything), then stop and let it reconnect at its
     * own pace. Transient (non-boot) select drops are covered by the ACK/retry
     * queue instead. */
    if (connect_requested && !module_alive &&
        timer_elapsed(last_attempt_time) >= CH582_CONNECT_RETRY_MS) {
        last_attempt_time = timer_read();
        uint8_t param = requested_profile;
        ch582_send_command(0xA6, &param, 1);
    }

    /* Drive the pending control action -- one switch instead of three
     * independent timer blocks. Cadences, budgets and clearing rules are the
     * table in findings-ch582-states.md. */
    switch (pa.kind) {
        case PA_BOUNCE:
            /* Second half of the cancel-pairing bounce: the real select. */
            if (timer_elapsed(pa.last_send) >= CH582_BOUNCE_MS) {
                pa.kind      = PA_SELECT;
                pa.tries     = 1;
                pa.last_send = timer_read();
                uint8_t p = pa.target;
                ch582_send_command(0xA6, &p, 1);
            }
            break;
        case PA_SELECT:
            if (pa.tries >= CH582_SELECT_MAX_TRIES) {
                pa.kind = PA_NONE;
            } else if (timer_elapsed(pa.last_send) >= CH582_SELECT_CONFIRM_MS) {
                pa.last_send = timer_read();
                pa.tries++;
                uint8_t param = requested_profile;
                ch582_send_command(0xA6, &param, 1);
            }
            break;
        case PA_PAIR:
            /* Resend A6 51 until the module confirms with 5B 31 -- it drops
             * the pair command while its own connect attempt is in flight.
             * Bounded so a module that never answers does not retry forever. */
            if (pa.tries >= CH582_PAIR_MAX_TRIES) {
                pa.kind = PA_NONE;
            } else if (timer_elapsed(pa.last_send) >= CH582_PAIR_RETRY_MS) {
                pa.last_send = timer_read();
                pa.tries++;
                uint8_t param = CH582_PAIR_PARAM;
                ch582_send_command(0xA6, &param, 1);
            }
            break;
        case PA_NONE:
        default:
            break;
    }

    /* Periodically poll the module for battery level. The module only emits 5C
     * battery frames in response to an A6 53 request (the stock firmware polls the
     * same way). Poll regardless of connection mode: the gauge is valid in BT,
     * 2.4G and USB-charging states, and A6 53 is a status query that doesn't touch
     * the link. */
    /* Report TX health alongside the battery poll (every 5 s), and only when
     * something went wrong -- silence means the link is clean. */
    {
        static uint32_t seen_timeout = 0, seen_drop = 0;
        static uint16_t stat_timer = 0;
        if (timer_elapsed(stat_timer) >= 5000) {
            stat_timer = timer_read();
            if (tx_stat_timeout != seen_timeout || tx_stat_drop != seen_drop) {
                printf("[ch582] sent=%lu ack-timeouts=%lu dropped=%lu\n",
                       (unsigned long)tx_stat_sent,
                       (unsigned long)tx_stat_timeout,
                       (unsigned long)tx_stat_drop);
                seen_timeout = tx_stat_timeout;
                seen_drop    = tx_stat_drop;
            }
#ifdef CONSOLE_ENABLE
            static uint8_t ack_report = 0;
            if (++ack_report >= 12) {                      /* once a minute */
                ack_report = 0;
                printf("[ch582] ack ms:");
                for (uint8_t i = 0; i < ACK_BUCKETS; i++) printf(" %lu", (unsigned long)ack_hist[i]);
                printf(" | max=%luus retried=%lu orphan=%lu | uart ovr=%lu fe=%lu pe=%lu\n",
                       (unsigned long)ack_max_us, (unsigned long)ack_after_retry,
                       (unsigned long)ack_orphan, (unsigned long)uart_err_overrun,
                       (unsigned long)uart_err_framing, (unsigned long)uart_err_parity);
            }
#endif
        }
    }

    /* First poll fires as soon as the module answers ANYTHING, not a full
     * CH582_BATTERY_POLL_MS after boot.
     *
     * last_battery_poll starts at 0 and timer_elapsed() is measured from boot,
     * so the old form waited out the whole 5 s interval before asking even
     * once -- which is exactly the "battery appears a few seconds late on every
     * boot" the owner noticed. Asking earlier than module_alive is pointless:
     * at cold boot the module's UART is not up yet and the frame is dropped
     * (the same reason the connect select needs its own cold-boot retry). */
    if (module_alive && !battery_seen) {
        if (timer_elapsed(last_battery_poll) >= CH582_BATTERY_FIRST_POLL_MS) {
            last_battery_poll = timer_read();
            ch582_poll_status();
        }
    } else if (timer_elapsed(last_battery_poll) >= CH582_BATTERY_POLL_MS) {
        last_battery_poll = timer_read();
        ch582_poll_status();
    }

#ifdef CONSOLE_ENABLE
    {
        static bool listening = false;
        if (!listening) {   /* lazily: the listener binds to this (main) thread */
            chEvtRegisterMaskWithFlags(chnGetEventSource(&CH582_SERIAL_DRIVER),
                                       &uart_err_listener, EVENT_MASK(0),
                                       SD_OVERRUN_ERROR | SD_FRAMING_ERROR | SD_PARITY_ERROR);
            listening = true;
        }
        eventflags_t f = chEvtGetAndClearFlags(&uart_err_listener);
        if (f & SD_OVERRUN_ERROR) uart_err_overrun++;
        if (f & SD_FRAMING_ERROR) uart_err_framing++;
        if (f & SD_PARITY_ERROR)  uart_err_parity++;
    }
#endif

    uint8_t c;
    uint8_t bytes_processed = 0;

    /* Drain the queue fully (capped to bound worst-case latency) so a connect
     * burst doesn't overflow the serial input buffer and shed bytes. */
    while (bytes_processed < 64) {
#ifdef WDT_TEST_HOOKS
        /* Fault injection (instrumented builds): bytes queued via
         * ch582_inject() are consumed BEFORE real UART bytes, as if received
         * from the module -- so a host script can replay every wire capture
         * in findings-ch582-states.md (missed 5B 32, the advertising
         * decline, byte soup) against the REAL parser and assert the
         * resulting state over raw HID. */
        extern bool ch582_inject_pop(uint8_t *out);
        if (ch582_inject_pop(&c)) {
            bytes_processed++;
        } else
#endif
        if (chnReadTimeout(&CH582_SERIAL_DRIVER, &c, 1, TIME_IMMEDIATE) == 0) break;
#ifdef WDT_TEST_HOOKS
        else if (ch582_rx_muted) { bytes_processed++; continue; } /* discard real byte */
#endif
        else bytes_processed++;

        b2 = b1;
        b1 = b0;
        b0 = c;

        bool matched = false;

