jdlien/qmk_firmware/keyboards/a_jazz/ak820pro/bluetooth/ch582f_ajazz.c
        if (b2 == 0x61 && b1 == 0x0D && b0 == 0x0A) {
            /* `61 0D 0A` ("a\r\n") is the per-frame ACK the module returns for what
             * we send -- NOT a connection signal (it is silent at idle). Use it to
             * release the in-flight TX frame so the next queued one can go. */
            ch582_tx_ack();
            matched             = true;
        } else if ((b2 == 0x5A || b2 == 0x5B || b2 == 0x5C) &&
                   b0 == ((uint8_t)(b2 + b1))) {
            uint8_t type       = b2;
            uint8_t d          = b1;
            switch (type) {
                case 0x5A: /* host LED bitmap (caps lock = bit1) */
                    /* The 1-byte additive checksum is weak, so the mixed RX stream
                     * (notably the CH582F power-up / 2.4G link-up burst) can throw a
                     * bogus 5A frame that spuriously lights Caps. Guard twofold:
                     *   - only honor LED frames once a link exists, and
                     *   - require a plausible HID LED bitmap (low 5 bits only:
                     *     num/caps/scroll/compose/kana). Random garbage that happens
                     *     to pass the checksum usually has high bits set. */
                    if (is_module_connected && (d & ~0x1F) == 0) {
                        host_leds = d;
                    } else if ((d & ~0x1F) == 0 && conn_state == CH582_CONN_LINKING &&
                               timer_elapsed32(linking_since) >= CH582_5A_PROMOTE_MS) {
                        /* Recovery for a missed `5B 32` -- see CH582_5A_PROMOTE_MS.
                         * Adopt the link, but deliberately NOT this frame's LED bits:
                         * the reason 5A is distrusted here at all is that a forged
                         * frame can pass the weak checksum, and lighting Caps off the
                         * very frame that establishes the link is the failure the
                         * guard above exists to prevent. A real host repeats its LED
                         * state, so the next 5A takes the normal path. */
                        is_module_connected = true;
                        is_pairing          = false;
                        conn_state          = CH582_CONN_CONNECTED;
                        connected_slot      = profile_to_slot(requested_profile);
                    }
                    break;
                case 0x5B: /* connection state code (NOT a slot number) */
                    switch (d) {
                        case 0x32: /* link established - the only "connected" signal */
                            /* A PA_BOUNCE survives: this 5B 32 may be the BOUNCE
                             * slot linking up mid-window, and the real target's
                             * select must still follow at the 700 ms mark --
                             * clearing it would strand the user on the wrong
                             * slot. (The triplet version's 5B 32 case never
                             * touched bounce_pending either.) */
                            if (pa.kind != PA_BOUNCE) pa.kind = PA_NONE;
                            is_module_connected = true;
                            is_pairing          = false;
                            conn_state          = CH582_CONN_CONNECTED;
                            connected_slot      = profile_to_slot(requested_profile);
                            break;
                        case 0x31: /* advertising / pairing, waiting for a device */
                            /* PA_BOUNCE survives here too, same reason as 32. */
                            if (pa.kind != PA_BOUNCE) pa.kind = PA_NONE;
                            is_pairing          = true;
                            is_module_connected = false;
                            conn_state          = CH582_CONN_PAIRING;
                            connected_slot      = 0;
                            host_leds           = 0; /* no link -> drop stale LED state */
                            break;
                        case 0x33: /* connect ATTEMPT - link is down and retrying */
                        case 0x34:
                            /* The module IS attempting: never re-issue the select
                             * now, or a slow (macOS directed-advertising)
                             * reconnect gets restarted and never completes. A
                             * pending PAIR survives -- the module ignores A6 51
                             * mid-attempt, which is why that retry exists. */
                            if (pa.kind == PA_SELECT) pa.kind = PA_NONE;
                            is_module_connected = false;
                            is_pairing          = false;
                            if (conn_state != CH582_CONN_LINKING) linking_since = timer_read32();
                            conn_state          = CH582_CONN_LINKING;
                            connected_slot      = 0;
                            host_leds           = 0; /* no link -> drop stale LED state */
                            break;
                        /* 0x36: connect attempt ABANDONED. Absent from
                         * CH582F_PROTOCOL.md's state table; the disassembly's
                         * "host refused" reading is a guess. CAPTURED ON THE WIRE
                         * 2026-08-29 selecting an unreachable slot:
                         *   5B 33, 5B 33, 5B 36, then 5B 23 (idle, ignored)
                         * so it follows failed attempts and then PERSISTS -- the
                         * module never retracts it. Note this is "the attempt
                         * failed", NOT "not paired": a bonded but powered-off
                         * host would look identical. Do not label it as bonding. */
                        case 0x36:
                            is_module_connected = false;
                            is_pairing          = false;
                            conn_state          = CH582_CONN_REJECTED;
                            connected_slot      = 0;
                            host_leds           = 0;
                            break;
                        default:
                            /* 0x23 idle/finalize: periodic, appears both
                             * connected and disconnected -> leave state.
                             *
                             * But it IS the moment the module stops advertising
                             * and becomes receptive again, so a select it
                             * declined can be re-issued right here. Measured: a
                             * select sent while advertising is ignored, and the
                             * 5B 23 lands ~6 s later. Retrying on the clock
                             * alone kept missing this window. */
                            if (pa.kind == PA_SELECT && d == 0x23 &&
                                pa.tries < CH582_SELECT_MAX_TRIES) {
                                pa.last_send = timer_read();
                                pa.tries++;
                                uint8_t p = requested_profile;
                                ch582_send_command(0xA6, &p, 1);
                            }
                            break;
                    }
                    break;
                case 0x5C: /* battery percent; PERIODIC and link-independent (streams
                            * even while disconnected) -> do NOT touch connection state */
                    if (d <= 100) {
                        battery_level     = d;
                        battery_last_recv = timer_read();
                        battery_seen      = true;
                        /* Lowest ever seen, for the debug page. The module is the
                         * only thing that can read the cell, and we have no idea
                         * how good its estimate is -- almost certainly a voltage
                         * reading, and lithium voltage is flat through the middle
                         * of the curve. A board that spends its life on the cable
                         * may report 100 forever, and a min that never moves off
                         * 100 is the cheapest possible evidence of that. */
                        if (d < battery_min) battery_min = d;
                    }
                    break;
            }
#if CH582_ACK_FRAMES
            /* Mirror stock: ack 5B (connection state) and 5C (battery), never 5A. */
            if (type == 0x5B || type == 0x5C) ch582_send_ack();
#endif
            matched = true;
        }

        if (matched) {
            /* Clear the window so the consumed bytes can't form a phantom overlap
             * match with the next byte. */
            b2 = b1 = b0 = 0;
        } else if ((b2 == 0x5A || b2 == 0x5B || b2 == 0x5C) &&
                   b0 != (uint8_t)(b2 + b1) &&
                   b0 != 0x5A && b0 != 0x5B && b0 != 0x5C && b0 != 0x61) {
            /* A frame-shaped window with a WRONG checksum, whose tail byte
             * cannot itself begin a new frame -- the signature of corrupted
             * UART traffic (what the 2026-08-29 priority inversion produced).
             * Count it: the counter is a TREND instrument, not an exact frame
             * count -- payload bytes can pose as type bytes, and a VALID frame
             * preceded by one type-looking noise byte also counts once before
             * parsing correctly (the window only protects a candidate starting
             * at b0, not b1). Expect a small false-positive rate; read trends,
             * not values. Main-loop context only (audit C-4).
             * (Audit finding IV-2, findings-input-validation.md.) */
            health_note_rx_malformed();
        }
    }

    /* Drive the reliable TX queue: send/retransmit/drop the in-flight frame.
     * AFTER the RX drain, not before it (codex review, 2026-09-23): an ACK
     * already sitting in the input queue must release the in-flight frame
     * before its timeout is judged. Pumped first, a buffered ACK could not
     * stop a needless retransmit, whose own ACK then arrived with nothing in
     * flight (an orphan) -- or, worse, popped the NEXT frame, since `61 0D 0A`
     * carries no sequence number. */
    ch582_tx_pump();
}
